Тест/Тест/src/Documents/ЗаявкаНаРасход/ЗаявкаНаРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРасход</name>
  <basedOn>Document.АктВозврата</basedOn>
  <basedOn>Document.ПоступлениеЗапчастей</basedOn>
  <basedOn>Document.Расходы</basedOn>
  <basedOn>Document.ЗаявкаНаРасходСотрудник</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.дт_СтатусыЗаявокНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
      <types>CatalogRef.ПроектыРазработки</types>
      <types>DocumentRef.АктВозврата</types>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>CatalogRef.Инвентарь</types>
      <types>DocumentRef.ЗаказНаряд</types>
      <types>DocumentRef.ЛистыУщерба</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскиеСчета</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Кредит</name>
    <type>
      <types>DocumentRef.ПриходОтКредитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлнируемыйРасход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Влияние</name>
    <type>
      <types>CatalogRef.ВлиянияРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоНакладной</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>НоменклатураТМЦ</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоНакладной</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИнвентаря</name>
      <type>
        <types>CatalogRef.ВидыИнвентаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Enums/ВидыОперацийСписаниеДенежныхСредств/ВидыОперацийСписаниеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСписаниеДенежныхСредств</name>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗаёмныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ТекущиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщикуЗапчастей</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеТраты</name>
  </enumValues>
  <enumValues>
    <name>КапитальныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПокупателю</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Documents/ЛичныйВывод/ЛичныйВывод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛичныйВывод</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.Учеридители</types>
    </type>
  </attributes>
  <attributes>
    <name>Откуда</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Учредитель</name>
    <type>
      <types>CatalogRef.Учредители</types>
    </type>
  </attributes>
</mdclass:Document>

Тест/Тест/src/Catalogs/ВидыРасходов/ВидыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КредитПлатеж</name>
      <description>Кредит платеж</description>
    </items>
    <items>
      <name>Топливо</name>
      <description>Топливо</description>
    </items>
  </predefined>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииСписаниеДенежныхСредств</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ТМЦВорктрак/ТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТМЦВорктрак</name>
  <attributes>
    <name>ВидИнвентаря</name>
    <type>
      <types>CatalogRef.ВидыИнвентаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БухКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ВидыРасходов_3/ВидыРасходов_3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходов_3</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Влияние</name>
    <type>
      <types>CatalogRef.ВлиянияРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительРодитель</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительРодительРодитель</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ОргСтруктураРасходы</name>
    <type>
      <types>CatalogRef.ОргСтруктураРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаВлияние</name>
    <attributes>
      <name>Влияние</name>
      <type>
        <types>CatalogRef.ВлиянияРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Documents/ЗаявкаНаРасход/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	ЗаполнитьСписокСогласовантов();
	ОбновитьДобавленныеКолонки();
	ОбновитьТипПолучателя();
	
	УстановитьУсловноеОформление();
	
	УправлениеФормой(ЭтаФорма);
	
	//Волков ИО 17.01.24 ++
	Элементы.Партия.Видимость = Ложь;
	//Волков ИО 17.01.24 --
		
	// ++ МазинЕС 10-07-24 
	Пользователь =ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя; 
	СсылкаПодьзователь = Справочники.Сотрудники.НайтиПоНаименованию(Пользователь) ; 
	
	//000000208 Панькина, 000000240 Мазин
	Если СсылкаПодьзователь.Код = "000000208"  Тогда
		Элементы.ПлнируемыйРасход.Видимость = Истина;
	Иначе
		Элементы.ПлнируемыйРасход.Видимость = Ложь;
	КонецЕсли;
	// -- МазинЕС 10-07-24
	
	
	Если объект.ТМЦ.Количество() > 0 тогда 
		ПосчитатьИтоги(); 
	КонецЕсли;
	 
	ЕСли НЕ ЗначениеЗаполнено(Объект.Ссылка) ТОгда 
		
		Объект.Статус = Перечисления.дт_СтатусыЗаявокНаРасход.Планово; 
				
	КонецЕсли; 
	   
КонецПроцедуры




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	///+ГомзМА 26.09.2023
	УстановитьВидимостьИДоступностьЭлементов();
	///-ГомзМА 26.09.2023
	
	//Волков ИО 27.12.2023 ++
	ИзменениеЗаголовкаРеквПолучатель();	
	//Волков ИО 27.12.2023 --
	
	//Волков ИО 17.01.2024 ++
	Элементы.Партия.Видимость = Ложь;
	ВидРасходаЗакупкаЕвропа();
	//Волков ИО 17.01.2024 --
	
	
	/// Комлев 17/06/24 +++ 
	ПоказатьКоличествоВТЧ();
	/// Комлев 17/06/24 ---
КонецПроцедуры


Процедура ВидРасходаЗакупкаЕвропа()
	
	Если Объект.ВидРасхода = Справочники.ВидыРасходов.НайтиПоКоду("000000042") ИЛИ Объект.ВидРасхода = Справочники.ВидыРасходов.НайтиПоКоду("000000009") Тогда
		
		Элементы.Партия.Видимость = Истина;
		
	Иначе 		
		
		Элементы.Партия.Видимость = Ложь;
 	
	КонецЕсли;
	
	
КонецПроцедуры

//Волков ИО 27.12.2023 ++
Процедура ИзменениеЗаголовкаРеквПолучатель()
	
	Если Объект.ВидРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.Зарплата Или
		 Объект.ВидРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ДополнительныеТраты	 
	Тогда	
	
		Элементы.Получатель.Заголовок = НСтр("ru = Сотрудник");
		
	ИначеЕсли Объект.ВидРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратЗаёмныхСредств Или
			  Объект.ВидРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ТекущиеРасходы Или 
			  Объект.ВидРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщикуЗапчастей Или
			  Объект.ВидРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.КапитальныеЗатраты  
	Тогда 
	
		Элементы.Получатель.Заголовок = НСтр("ru = Поставщик");
		
	ИначеЕсли  Объект.ВидРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда 
		
		Элементы.Получатель.Заголовок = НСтр("ru = Клиент");
		
	КонецЕсли;

КонецПроцедуры
//Волков ИО 27.12.2023 --

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры



&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДобавленныеКолонки();
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
    РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
		//++МазинЕС 24-05-24
			Если ЗначениеЗаполнено(Объект.Основание) Тогда 
			Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ПоступлениеЗапчастей") Тогда
				СсылкаНаОбъект = Объект.Основание;
				Форма = ПолучитьФорму("Документ.ПоступлениеЗапчастей.Форма.ФормаДокумента", Новый Структура("Ключ", СсылкаНаОбъект));
				Форма.Записать();
			КонецЕсли; 
			КонецЕсли; 
	//--МазинЕС 24-05-24
	//
	///+ГомзМА 25.09.2023
	НовыйДокумент = СоздатьДопТраты();
	
	Если НовыйДокумент <> Неопределено Тогда
		ОткрытьЗначение(НовыйДокумент);
	КонецЕсли;
	///-ГомзМА 25.09.2023

	//Волков ИО 17.01.24 ++
	ЗакупкаЕвропа = ПолучитьСпрВидыРасходовзакупкаЕвропа();
	Если Объект.ВидРасхода = ЗакупкаЕвропа И Не ЗначениеЗаполнено(Объект.Партия) Тогда  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установите партию";
		Сообщение.Поле = "Партия";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		Отказ = Истина; 
	КонецЕсли;
	//Волков ИО 17.01.24 --

	
КонецПроцедуры

//Волков ИО 16.01.24 ++
Функция ПолучитьСпрВидыРасходовзакупкаЕвропа()
                                                 //ЗАКУПКА ЕВРОПА
	Возврат Справочники.ВидыРасходов.НайтиПоКоду("000000042");		
	
КонецФункции
//Волков ИО 16.01.24 --


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДатаПриИзмененииСервер();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ДатаПриИзмененииСервер()

//	Если дт_Нумерация.ГодИзменен(Объект.Ссылка, Объект.Дата) Тогда
//		Объект.Номер = "";
//	КонецЕсли;

КонецПроцедуры // ДатаПриИзмененииСервер()

&НаКлиенте
Процедура ИнициаторПриИзменении(Элемент)
	ИнициаторПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ИнициаторПриИзмененииСервер()
	
	Если НЕ ЗначениеЗаполнено(Объект.Инициатор) Тогда
		Возврат
	КонецЕсли;
	
	КадровыеДанные = дт_Зарплата.ПолучитьКадровыеДанные(Объект.Инициатор); 
	
	Если КадровыеДанные <> Неопределено Тогда
		Объект.Подразделение = КадровыеДанные.Подразделение;
	КонецЕсли;	
			
КонецПроцедуры

&НаКлиенте
Процедура ВидРасходаПриИзменении(Элемент)
	
	ЗаполнитьСписокСогласовантов();
	ОбновитьТипПолучателя();
 
    Значение = Объект[Элемент.Имя];
    Объект[Элемент.Имя] = Элемент.ОграничениеТипа.ПривестиЗначение(Значение);
	
	УправлениеФормой(ЭтаФорма);
	
	УстановитьВидимостьИДоступностьЭлементов();
	
	//Волков ИО 17.01.24 ++
	ВидРасходаЗакупкаЕвропа();
	//Волков ИО 17.01.24 --
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	ЗаполнитьСписокСогласовантов();
	ОбновитьДобавленныеКолонки();
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьТипПолучателя()

	Если Не ЗначениеЗаполнено(Объект.ВидРасхода) Тогда 
		Возврат
	КонецЕсли;
	
	СвойстваВидаРасхода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидРасхода, "Зарплата,ВидОперацииСписаниеДенежныхСредств");
	
	Если СвойстваВидаРасхода.Зарплата
		ИЛИ СвойстваВидаРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.Зарплата Тогда
		
		ТипСтр = "СправочникСсылка.Сотрудники";
	
	Иначе
				
		ТипСтр = "СправочникСсылка.Контрагенты";
			
	КонецЕсли;
	
	Если объект.ВидРасхода = Справочники.ВидыРасходов.НайтиПоКоду("000000041") Тогда
		
		ТипСтр = "СправочникСсылка.Клиенты";
		
	КонецЕсли;
	
		
	
	Элемент = Элементы.Найти("Получатель");
	
	Если Элемент <> Неопределено Тогда
	    
	    Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
	    Элемент.ВыбиратьТип = Ложь;	
    
    КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Товары

&НаСервереБезКонтекста
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ДанныеЗаполнения)

	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("Товары", "Количество");
КонецПроцедуры



/// Комлев 17/06/24 +++
&НаКлиенте
Процедура ЗапчастиКоличествоПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("Запчасти", "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиЦенаПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("Запчасти", "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиСуммаПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("Запчасти", "Сумма");
КонецПроцедуры


&НаКлиенте
Процедура ТМЦКоличествоПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("ТМЦ", "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ТМЦЦенаПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("ТМЦ", "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТМЦСуммаПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("ТМЦ", "Сумма");
КонецПроцедуры

/// Комлев 17/06/24 +++

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("Товары", "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("Товары", "Сумма");
КонецПроцедуры






#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	
КонецПроцедуры


&НаСервере
Функция ПечатьЗаявкаНаПоступлениеНаСервере()
	
	///+ГомзМА 05.04.2023 
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ЗаявкаНаРасход.ПолучитьМакет("ЗаявкаНаПоступлениеЗапчастей");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаРасходТовары.Товар КАК Товар,
	|	ЗаявкаНаРасходТовары.Количество КАК Количество,
	|	ЗаявкаНаРасходТовары.Цена КАК Цена,
	|	ЗаявкаНаРасходТовары.Ссылка.Дата КАК Дата,
	|	ЗаявкаНаРасходТовары.Ссылка.Ответственный КАК Ответственный,
	|	ЗаявкаНаРасходТовары.Ссылка.Получатель КАК Получатель,
	|	ЗаявкаНаРасходТовары.Ссылка.ВидРасхода КАК ВидРасхода,
	|	ЗаявкаНаРасходТовары.Ссылка.Ссылка КАК Ссылка,
	|	СпрНоменклатура.Код КАК Код,
	|	СпрНоменклатура.НомерПроизводителя КАК НомерПроизводителя,
	|	ПоступлениеЗапчастей.Номер КАК НомерПоступления,
	|	Контрагенты.Телефон КАК Телефон,
	|	Контрагенты.Город2 КАК Город
	|ИЗ
	|	Документ.ЗаявкаНаРасход.Товары КАК ЗаявкаНаРасходТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ЗаявкаНаРасходТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей
	|		ПО ЗаявкаНаРасходТовары.Ссылка = ПоступлениеЗапчастей.ЗаявкаНаРасход
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ЗаявкаНаРасходТовары.Ссылка.Получатель = Контрагенты.Ссылка
	|ГДЕ
	|	ЗаявкаНаРасходТовары.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаЗапрос = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ОбластьШапкаТЧ");
	ОбластьТЧ = Макет.ПолучитьОбласть("ОбластьТЧ");
	ОбластьПодпись = Макет.ПолучитьОбласть("ОбластьПодпись");
	ТабДок.Очистить();
	
ВыборкаЗапрос.Следующий();
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьШапка, ВыборкаЗапрос.Уровень());
	
	ТабДок.Вывести(ОбластьШапкаТЧ);
	
	ОбластьТЧ.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьТЧ, ВыборкаЗапрос.Уровень());
	
	Пока ВыборкаЗапрос.Следующий() Цикл
		ОбластьТЧ.Параметры.Заполнить(ВыборкаЗапрос);
		ТабДок.Вывести(ОбластьТЧ, ВыборкаЗапрос.Уровень());
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодпись);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	Возврат ТабДок;
	///-ГомзМА 05.04.2023 
	
КонецФункции

&НаКлиенте
Процедура ПечатьЗаявкаНаПоступление(Команда)
	
	///+ГомзМА 05.04.2023
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	//ПериодДляПечати = Элементы.ПериодДляПечати;
	ТабДок = ПечатьЗаявкаНаПоступлениеНаСервере();
	
	// создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЗаявкаНаПоступлениеЗапчастей");
	// Добавляем в коллекцию (тип массив) сформированный Табличный документ
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	// если требуется устанавливаем параметры печати
	КоллекцияПечатныхФорм[0].Экземпляров=1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "ЗаявкаНаПоступлениеЗапчастей";  // используется для формирования имени файла при сохранении из общей формы печати документов
	// .. и выводим стандартной процедурой БСП
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
	///-ГомзМА 05.04.2023
	
	//ПечатьЗаявкаНаПоступлениеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	Элементы.СуммаДокумента.ТолькоПросмотр = Объект.Товары.Количество() <> 0;
	
	Элементы.Согласовал.ТолькоПросмотр = НЕ Форма.ЕстьПравоСогласования;
	Элементы.КомандаСогласовать.Видимость = НЕ Элементы.Согласовал.ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСогласовать(Команда)
	
	Объект.Согласовал = ПользователиКлиентСервер.ТекущийПользователь();
	// ++ МазинЕС 10-07-2024 Нажали согласовать и заявка попадает в список заявок который все видят 
	объект.ПлнируемыйРасход = Ложь; 
	// -- МазинЕС 10-07-2024	
КонецПроцедуры

Процедура ПоказатьКоличествоВТЧ()
	/// Комлев 17/06/24 +++
	Элементы.ГруппаЗапчасти.Заголовок  = "Запчасти" + " ( " + Объект.Запчасти.Количество() + " )" ;
	Элементы.ТоварыТМЦ.Заголовок  = "ТоварыТМЦ" + " ( " + Объект.ТМЦ.Количество() + " )" ;
	Элементы.ГруппаУслуги.Заголовок  = "Услуги" + " ( " + Объект.Услуги.Количество() + " )" ;
	/// Комлев 17/06/24 ---
КонецПроцедуры
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ПосчитатьИтоги();
	ЗаполнитьСписокСогласовантов();
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиПриИзменении(Элемент)
	ПосчитатьИтоги();
	ПоказатьКоличествоВТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ТМЦПриИзменении(Элемент)
	ПосчитатьИтоги();
	ПоказатьКоличествоВТЧ();
КонецПроцедуры
 // УправлениеФормой()

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ПосчитатьИтоги();
	ПоказатьКоличествоВТЧ();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Товары.Отменено
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Товары");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Товары.Отменено", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДобавленныеКолонки()
	
	Оплачено = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СУММА(Расходы.Сумма) КАК Сумма
			|ИЗ
			|	Документ.Расходы КАК Расходы
			|ГДЕ
			|	Расходы.ЗаявкаНаРасход = &ЗаявкаНаРасход
			|	И Расходы.Проведен";
		
		Запрос.УстановитьПараметр("ЗаявкаНаРасход", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Оплачено = ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма)
				И ВыборкаДетальныеЗаписи.Сумма >= Объект.СуммаДокумента; 
		КонецЕсли;
	
	КонецЕсли;
	
	СостояниеОплаты = ?(Оплачено, "Оплачено", "Не оплачено");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСтроки(ИмяТабличнойЧасти, Поле = Неопределено, ДанныеСтроки = Неопределено)
	
	ТекДанные = ?(ДанныеСтроки = Неопределено, Элементы[ИмяТабличнойЧасти].ТекущиеДанные, ДанныеСтроки);
	
	Если Поле = "Сумма" Тогда
		Если ТекДанные.Количество <> 0 Тогда
			ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
		КонецЕсли;	
	Иначе	
		ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры
 // ОбработкаИзмененияСтроки()

&НаСервере
Процедура ЗаполнитьСписокСогласовантов()

	УстановитьПривилегированныйРежим(Истина);
	
	Элементы.Согласовал.СписокВыбора.Очистить();
	Элементы.Согласовал.СписокВыбора.Добавить(Справочники.Пользователи.ПустаяСсылка(), "Не согласовано");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка,
		|	Пользователи.Представление
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.Недействителен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Справочники.Пользователи.РазрешеноСогласование(Объект, ВыборкаДетальныеЗаписи.Ссылка) Тогда
			
			ФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаДетальныеЗаписи.Представление);
			Элементы.Согласовал.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ФИО);
			
		КонецЕсли;	
	КонецЦикла;
	
	ЕстьПравоСогласования = Элементы.Согласовал.СписокВыбора.НайтиПоЗначению(Пользователи.ТекущийПользователь()) <> Неопределено;
	
	// Проверка права у того, кто согласовал ранее
	Если ЗначениеЗаполнено(Объект.Согласовал) 
		И Элементы.Согласовал.СписокВыбора.НайтиПоЗначению(Объект.Согласовал) = Неопределено Тогда
		
		Объект.Согласовал = Неопределено;
		
	КонецЕсли;  
		
КонецПроцедуры

&НаСервере
Функция ОбновитьСумму(НазваниеТЧ)
	/// Комлев 17/06/24 +++
	Если Объект[НазваниеТЧ].Количество() <> 0 Тогда
		Сумма = 0;
		Для каждого СтрокаТаблицы Из Объект[НазваниеТЧ] Цикл
			Если СтрокаТаблицы.Отменено = Ложь Тогда
				Сумма = Сумма + СтрокаТаблицы.Сумма;
			Иначе Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Число(Сумма);
	
	КонецЕсли;
		Возврат 0;
	/// Комлев 17/06/24 ---
КонецФункции

&НаСервере
Процедура ПосчитатьИтоги()
	/// Комлев 17/06/24 +++
	ОбщСумма = 0.00;
	ИтогТовары = ОбновитьСумму("Товары");
	ИтогЗапчасти = ОбновитьСумму("Запчасти");
	ИтогТМЦ = ОбновитьСумму("ТМЦ");
	ИтогУслуги = ОбновитьСумму("Услуги");
	ОбщСумма = ОбщСумма + ИтогТовары + ИтогЗапчасти + ИтогТМЦ + ИтогУслуги;
	Объект.СуммаДокумента = ОбщСумма;
	/// Комлев 17/06/24 ---
КонецПроцедуры


&НаКлиенте
Процедура ТМЦНоменклатураТМЦПриИзменении(Элемент)
	ТекДанные = Элементы.ТМЦ.ТекущиеДанные;
	ТМЦНоменклатураТМЦПриИзмененииНаСервере(ТекДанные.Код, ТекДанные.НоменклатураТМЦ, ТекДанные.ВидИнвентаря );
КонецПроцедуры

&НаСервере
Процедура ТМЦНоменклатураТМЦПриИзмененииНаСервере(Код, Номенклатура, ВидИнвентаря)
	/// Комлев 17/06/24 +++
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТМЦВорктрак.Код,
		|	ТМЦВорктрак.ВидИнвентаря
		|ИЗ
		|	Справочник.ТМЦВорктрак КАК ТМЦВорктрак
		|ГДЕ
		|	ТМЦВорктрак.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",  Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Код = ВыборкаДетальныеЗаписи.Код;
			ВидИнвентаря = ВыборкаДетальныеЗаписи.ВидИнвентаря;
		КонецЦикла;
	КонецЕсли;
	/// Комлев 17/06/24 ---
КонецПроцедуры


&НаСервере
Функция ПечатьЗаявкаНаРасходНаСервере()
	
	///+ГомзМА 21.04.2023 
	ТабДок = Новый ТабличныйДокумент;
	Макет  = Документы.ЗаявкаНаРасход.ПолучитьМакет("ЗаявкаНаРасход");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаРасходТовары.Товар КАК Товар,
	|	ЗаявкаНаРасходТовары.Количество КАК Количество,
	|	ЗаявкаНаРасходТовары.Цена КАК Цена,
	|	ЗаявкаНаРасходТовары.Ссылка.Дата КАК Дата,
	|	ЗаявкаНаРасходТовары.Ссылка.Ответственный КАК Ответственный,
	|	ЗаявкаНаРасходТовары.Ссылка.Получатель КАК Получатель,
	|	ЗаявкаНаРасходТовары.Ссылка.ВидРасхода КАК ВидРасхода,
	|	ЗаявкаНаРасходТовары.Ссылка.Ссылка КАК Ссылка,
	|	СпрНоменклатура.Код КАК Код,
	|	СпрНоменклатура.НомерПроизводителя КАК НомерПроизводителя,
	|	ПоступлениеЗапчастей.Номер КАК НомерПоступления,
	|	Контрагенты.Телефон КАК Телефон,
	|	Контрагенты.Город2 КАК Город,
	|	ЗаявкаНаРасходТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаНаРасходТовары.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ЗаявкаНаРасходТовары.Ссылка.Инициатор КАК Инициатор,
	|	ЗаявкаНаРасходТовары.Сумма КАК Сумма,
	|	ЗаявкаНаРасходТовары.Ссылка.Номер КАК Номер
	|ИЗ
	|	Документ.ЗаявкаНаРасход.Товары КАК ЗаявкаНаРасходТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ЗаявкаНаРасходТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей
	|		ПО ЗаявкаНаРасходТовары.Ссылка = ПоступлениеЗапчастей.ЗаявкаНаРасход
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ЗаявкаНаРасходТовары.Ссылка.Получатель = Контрагенты.Ссылка
	|ГДЕ
	|	ЗаявкаНаРасходТовары.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаЗапрос = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьШапка 	 = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьТЧ 		 = Макет.ПолучитьОбласть("ОбластьТЧ");
	ОбластьПодпись 	 = Макет.ПолучитьОбласть("ОбластьПодпись");
	ТабДок.Очистить();
	
	ВыборкаЗапрос.Следующий();
	
	ОбластьЗаголовок.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьЗаголовок, ВыборкаЗапрос.Уровень());
	
	ОбластьШапка.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьШапка, ВыборкаЗапрос.Уровень());
	
	ОбластьТЧ.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьТЧ, ВыборкаЗапрос.Уровень());
	
	Пока ВыборкаЗапрос.Следующий() Цикл
		ОбластьТЧ.Параметры.Заполнить(ВыборкаЗапрос);
		ТабДок.Вывести(ОбластьТЧ, ВыборкаЗапрос.Уровень());
	КонецЦикла;
	
	ОбластьПодпись.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьПодпись);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	Возврат ТабДок;
	///-ГомзМА 21.04.2023 
	
	
КонецФункции

&НаКлиенте
Процедура ПечатьЗаявкаНаРасход(Команда)
	
	///+ГомзМА 21.04.2023
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	//ПериодДляПечати = Элементы.ПериодДляПечати;
	ТабДок = ПечатьЗаявкаНаРасходНаСервере();
	
	// создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЗаявкаНаРасход");
	// Добавляем в коллекцию (тип массив) сформированный Табличный документ
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	// если требуется устанавливаем параметры печати
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "ЗаявкаНаРасход";  // используется для формирования имени файла при сохранении из общей формы печати документов
	// .. и выводим стандартной процедурой БСП
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
	///-ГомзМА 21.04.2023
	
КонецПроцедуры

&НаСервере
Функция ПечатьЗаявкаНаРасходЗапчастейНаСервере()
	
	///+ГомзМА 24.04.2023 
	ТабДок = Новый ТабличныйДокумент;
	Макет  = Документы.ЗаявкаНаРасход.ПолучитьМакет("ЗаявкаНаРасходЗапчастей");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаРасходТовары.Товар КАК Товар,
	|	ЗаявкаНаРасходТовары.Количество КАК Количество,
	|	ЗаявкаНаРасходТовары.Цена КАК Цена,
	|	ЗаявкаНаРасходТовары.Ссылка.Дата КАК Дата,
	|	ЗаявкаНаРасходТовары.Ссылка.Ответственный КАК Ответственный,
	|	ЗаявкаНаРасходТовары.Ссылка.Получатель КАК Получатель,
	|	ЗаявкаНаРасходТовары.Ссылка.ВидРасхода КАК ВидРасхода,
	|	ЗаявкаНаРасходТовары.Ссылка.Ссылка КАК Ссылка,
	|	СпрНоменклатура.Код КАК Код,
	|	СпрНоменклатура.НомерПроизводителя КАК НомерПроизводителя,
	|	ПоступлениеЗапчастей.Номер КАК НомерПоступления,
	|	Контрагенты.Телефон КАК Телефон,
	|	Контрагенты.Город2 КАК Город,
	|	ЗаявкаНаРасходТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаНаРасходТовары.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ЗаявкаНаРасходТовары.Ссылка.Инициатор КАК Инициатор,
	|	ЗаявкаНаРасходТовары.Сумма КАК Сумма,
	|	ЗаявкаНаРасходТовары.Ссылка.Номер КАК Номер
	|ИЗ
	|	Документ.ЗаявкаНаРасход.Товары КАК ЗаявкаНаРасходТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ЗаявкаНаРасходТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей
	|		ПО ЗаявкаНаРасходТовары.Ссылка = ПоступлениеЗапчастей.ЗаявкаНаРасход
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ЗаявкаНаРасходТовары.Ссылка.Получатель = Контрагенты.Ссылка
	|ГДЕ
	|	ЗаявкаНаРасходТовары.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаЗапрос = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьШапка 	 = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьТЧ 		 = Макет.ПолучитьОбласть("ОбластьТЧ");
	ОбластьПодпись 	 = Макет.ПолучитьОбласть("ОбластьПодпись");
	ТабДок.Очистить();
	
	ВыборкаЗапрос.Следующий();
	
	ОбластьЗаголовок.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьЗаголовок, ВыборкаЗапрос.Уровень());
	
	ОбластьШапка.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьШапка, ВыборкаЗапрос.Уровень());
	
	ОбластьТЧ.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьТЧ, ВыборкаЗапрос.Уровень());
	
	Пока ВыборкаЗапрос.Следующий() Цикл
		ОбластьТЧ.Параметры.Заполнить(ВыборкаЗапрос);
		ТабДок.Вывести(ОбластьТЧ, ВыборкаЗапрос.Уровень());
	КонецЦикла;
	
	ОбластьПодпись.Параметры.Заполнить(ВыборкаЗапрос);
	ТабДок.Вывести(ОбластьПодпись);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	Возврат ТабДок;
	///-ГомзМА 24.04.2023 
	
КонецФункции

&НаКлиенте
Процедура ПечатьЗаявкаНаРасходЗапчастей(Команда)
	
	///+ГомзМА 24.04.2023
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	//ПериодДляПечати = Элементы.ПериодДляПечати;
	ТабДок = ПечатьЗаявкаНаРасходЗапчастейНаСервере();
	
	// создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЗаявкаНаРасходЗапчастей");
	// Добавляем в коллекцию (тип массив) сформированный Табличный документ
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	// если требуется устанавливаем параметры печати
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "ЗаявкаНаРасходЗапчастей";  // используется для формирования имени файла при сохранении из общей формы печати документов
	// .. и выводим стандартной процедурой БСП
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
	///-ГомзМА 24.04.2023
	
КонецПроцедуры


&НаСервере
Функция СоздатьДопТраты()

	///+ГомзМА 25.09.2023
	Если Объект.Ссылка = Документы.ЗаявкаНаРасход.ПустаяСсылка() Тогда
		Если Объект.ВидРасхода = Справочники.ВидыРасходов.НайтиПоКоду("000000043") ИЛИ
			Объект.ВидРасхода = Справочники.ВидыРасходов.НайтиПоКоду("000000044") ИЛИ
			Объект.ВидРасхода = Справочники.ВидыРасходов.НайтиПоКоду("000000039") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УстановитьЗП.ВидРасхода КАК ВидРасхода,
			|	УстановитьЗП.Зарплата КАК Зарплата,
			|	УстановитьЗП.Учредитель КАК Учредитель
			|ИЗ
			|	РегистрСведений.УстановитьЗП КАК УстановитьЗП
			|ГДЕ
			|	УстановитьЗП.ВидРасхода = &ВидРасхода";
			
			Запрос.УстановитьПараметр("ВидРасхода", Объект.ВидРасхода);
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			
			РезультатЗапроса.Следующий();
			
			СуммаЗаОтчетныйПериод = ПолучитьСуммуЗаОтчетныйПериод();
			
			Если СуммаЗаОтчетныйПериод + Объект.СуммаДокумента > РезультатЗапроса.Зарплата Тогда
				ДопТраты = СуммаЗаОтчетныйПериод + Объект.СуммаДокумента - РезультатЗапроса.Зарплата;
				
				НовыйДокумент = Документы.ЛичныйВывод.СоздатьДокумент();
				НовыйДокумент.Дата 		 = ТекущаяДатаСеанса();
				НовыйДокумент.Учредитель = РезультатЗапроса.Учредитель;
				НовыйДокумент.Откуда 	 = Объект.Счет;
				НовыйДокумент.Сумма 	 = ДопТраты;
				НовыйДокумент.Записать();
				
				Объект.СуммаДокумента = Объект.СуммаДокумента - ДопТраты;
				Если Объект.СуммаДокумента = 0 Тогда
					Сообщить("Зарплата за отчетный месяц уже выдана! Дополнительные траты созданы.");
				КонецЕсли;
				
				Возврат НовыйДокумент.Ссылка;
				
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	///-ГомзМА 25.09.2023

КонецФункции

&НаКлиенте
Процедура ЗапчастиНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Запчасти.ТекущиеДанные;
	ЗапчастиНоменклатураПриИзмененииНаСервере(ТекДанные.Код, ТекДанные.Номенклатура, ТекДанные.НомерПроизводителя);
	
КонецПроцедуры

&НаСервере
Процедура ЗапчастиНоменклатураПриИзмененииНаСервере(Код, Номенклатура, НомерПроизводителя)
	/// Комлев 17/06/24 +++
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Код,
		|	Номенклатура.НомерПроизводителя
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Код = ВыборкаДетальныеЗаписи.Код;
			НомерПроизводителя = ВыборкаДетальныеЗаписи.НомерПроизводителя;
		КонецЦикла;
	КонецЕсли;
	
	/// Комлев 17/06/24 ---
КонецПроцедуры




&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов()

	///+ГомзМА 26.09.2023
	Если Объект.ВидРасхода.ВидОперацииСписаниеДенежныхСредств = Перечисления.ВидыОперацийСписаниеДенежныхСредств.Зарплата Тогда
		Элементы.Месяц.Видимость = Истина;
	Иначе
		Элементы.Месяц.Видимость = Ложь;
	КонецЕсли;
	///-ГомзМА 26.09.2023
	
	///+ГомзМА 21.12.2023
	Если Объект.ВидРасхода = Справочники.ВидыРасходов.КредитПлатеж Тогда
		Элементы.Кредит.Видимость = Истина;
		Элементы.НаименованиеКредита.Видимость = Истина;
	Иначе
		Элементы.Кредит.Видимость = Ложь;
		Элементы.НаименованиеКредита.Видимость = Ложь;
	КонецЕсли;
	///-ГомзМА 21.12.2023
	
	КонецПроцедуры


&НаСервере
Функция ПолучитьСуммуЗаОтчетныйПериод()

	///+ГомзМА 26.09.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЗаявкаНаРасход.СуммаДокумента, 0)) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Сумма
		|ИЗ
		|	Документ.ЗаявкаНаРасход КАК ЗаявкаНаРасход
		|ГДЕ
		|	ЗаявкаНаРасход.ВидРасхода = &ВидРасхода
		|	И ЗаявкаНаРасход.Месяц = &Месяц
		|	И ГОД(ЗаявкаНаРасход.Дата) = &Год
		|	И ЗаявкаНаРасход.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_Сумма.Сумма, 0) КАК Сумма
		|ИЗ
		|	ВТ_Сумма КАК ВТ_Сумма";
	
	Запрос.УстановитьПараметр("ВидРасхода", 	Объект.ВидРасхода);
	Запрос.УстановитьПараметр("Месяц", 			Объект.Месяц);
	Запрос.УстановитьПараметр("Год", 			Год(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();

	Возврат РезультатЗапроса.Сумма;
	///-ГомзМА 26.09.2023

КонецФункции // ПолучитьСуммуЗаОтчетныйПериод()

&НаСервере
Процедура СчетПриИзмененииНаСервере()

	  Если Не Объект.Организация = Объект.Счет Тогда 
		
		Объект.Организация = Неопределено;
		Объект.Организация = Объект.Счет.Владелец
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	СчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьРодителяВидыРасходов_3()
	
	Родитель = Справочники.ВидыРасходов_3.НайтиПоКоду("000000001");
	Возврат Родитель ;

КонецФункции

&НаКлиенте
Процедура ФилиалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Объект.Отдел 				= Неопределено;  
	Объект.Категория 		= Неопределено;
	Объект.Отдел 				= Неопределено;
	Объект.Категория 		= Неопределено;
	Объект.Статья 			= Неопределено;
	Объект.Влияние			= Неопределено;
	Объект.ВидыРасхода_3 	= Неопределено;
	
	
	СтандартнаяОбработка = ЛОЖЬ;
    Родитель = ПолучитьРодителяВидыРасходов_3();
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", Родитель);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Филиал");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Форм.Заголовок = "Категории расходов";
КонецПроцедуры

&НаКлиенте
Процедура ОтделНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объект.Категория 		= Неопределено;
	Объект.Отдел 				= Неопределено;
	Объект.Статья 			= Неопределено;
	Объект.Влияние			= Неопределено;
	Объект.ВидыРасхода_3 	= Неопределено;
	
	СтандартнаяОбработка = ЛОЖЬ;
    
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", объект.Филиал);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Отдел");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Форм.Заголовок = "Категории расходов";
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)


	Объект.Категория 	= Неопределено;
	Объект.Статья 		= Неопределено;

	
	СтандартнаяОбработка = ЛОЖЬ;
    
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", объект.ВидыРасхода_3);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Категория");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Форм.Заголовок = "Категории расходов";
КонецПроцедуры

&НаКлиенте
Процедура СтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
			ЕСли ЗначениеЗаполнено(Объект.Категория) ТОгда 
				СтандартнаяОбработка = ЛОЖЬ;
				
			    Отбор = Новый Структура();
			    Отбор.Вставить("Родитель", Объект.Категория);
			    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
			    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
			    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			    
			    
			    ПараметрыФормы = Новый Структура();
			    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
			    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
			    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
			    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
			    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
			    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
				ПараметрыФормы.Вставить("Отбор", Отбор);
			
				ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Статья");
				Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
				ЭтаФорма, , , , ОбработкаВыбора);
				Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
				Форм.Заголовок = "Категории расходов";
			КонецЕсли; 	
			
			ЕСли НЕ ЗначениеЗаполнено(Объект.Филиал) И НЕ ЗначениеЗаполнено(Объект.Отдел) 
			И НЕ ЗначениеЗаполнено(Объект.ВидыРасхода_3) И НЕ ЗначениеЗаполнено(Объект.Категория)  ТОгда 
		
				СтандартнаяОбработка = ЛОЖЬ;
				
			   Отбор = Новый Структура();
			   Отбор.Вставить("Родитель", ПредопределенноеЗначение("Справочник.ВидыРасходов_3.ПустаяСсылка"));
			   Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
			   Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
			   Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			    
			   ПараметрыФормы = Новый Структура();
			   ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
			   ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
			   ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			   ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
			   ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
				ПараметрыФормы.Вставить("Отбор", Отбор);
			
				ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Статья");
				Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
				ЭтаФорма, , , , ОбработкаВыбора);
				Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
				Форм.Заголовок = "Категории расходов";
			
			КонецЕсли;
			
			ЕСли НЕ ЗначениеЗаполнено(Объект.Категория) И ЗначениеЗаполнено(Объект.Отдел) ТОгда 
		
				СтандартнаяОбработка = ЛОЖЬ;
				
			   Отбор = Новый Структура();
			   Отбор.Вставить("РодительРодитель", Объект.ВидыРасхода_3);
			   Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
			   Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
			   Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			    
			   ПараметрыФормы = Новый Структура();
			   ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
			   ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
			   ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			   ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
			   ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
				ПараметрыФормы.Вставить("Отбор", Отбор);
			
				ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Статья");
				Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
				ЭтаФорма, , , , ОбработкаВыбора);
				Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
				Форм.Заголовок = "Категории расходов";
			
			КонецЕсли;
		
			
		
		
КонецПроцедуры

&НаКлиенте
Процедура ВидыРасхода_3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
				
				Объект.Категория 	= Неопределено;
				Объект.Статья 		= Неопределено;
				
				СтандартнаяОбработка = ЛОЖЬ;
				
			   Отбор = Новый Структура();
			   Отбор.Вставить("Родитель", Объект.Отдел);
			   Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
			   Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
			   Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			    
			   ПараметрыФормы = Новый Структура();
			   ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
			   ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
			   ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			   ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
			   ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
				ПараметрыФормы.Вставить("Отбор", Отбор);
			
				ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Виды_Расходов_3");
				Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
				ЭтаФорма, , , , ОбработкаВыбора);
				Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;

КонецПроцедуры



&НаСервере
Процедура ЗаполнениеСпискаВлияние()
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыРасходов_3ТаблицаВлияние.Влияние КАК Влияние,
	|	ВидыРасходов_3ТаблицаВлияние.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Таб_ВидыРсх3
	|ИЗ
	|	Справочник.ВидыРасходов_3.ТаблицаВлияние КАК ВидыРасходов_3ТаблицаВлияние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлиянияРасходы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Таб_ВидыРсх3 КАК ВТ_Таб_ВидыРсх3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВлиянияРасходы КАК ВлиянияРасходы
	|		ПО (ВТ_Таб_ВидыРсх3.Влияние = ВлиянияРасходы.Ссылка)
	|ГДЕ
	|	ВТ_Таб_ВидыРсх3.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Отдел);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.Влияние.СписокВыбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Влияние.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт

   //Дополнительные условия если необходимо
   Если ДопПараметры = "Филиал" тогда

    	Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Филиал = Значение ///Если Множественный Выбор - то вернется массив 
    
    ИНачеЕсли ДопПараметры = "Отдел" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Отдел = Значение; ///Если Множественный Выбор - то вернется массив
   		ЗаполнениеСпискаВлияние(); 
     ИНачеЕсли ДопПараметры = "Категория" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Категория = Значение ///Если Множественный Выбор - то вернется массив
   
   ИНачеЕсли ДопПараметры = "Статья" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Статья = Значение;  ///Если Множественный Выбор - то вернется массив
   		
   		Если НЕ ЗначениеЗаполнено(Объект.Категория) ТОгда 
   			Объект.Категория = ОпределитьКатегориюСтатьи(Значение);
   		КонецЕсли;  
   		
   ИНачеЕсли ДопПараметры = "Статья2" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Статья = Значение ///Если Множественный Выбор - то вернется массив
   
   ИНачеЕсли ДопПараметры = "Виды_Расходов_3" тогда
		
		Если Значение = Неопределено Тогда  
        	Возврат;
    	КонецЕсли;
    	
    	Объект.ВидыРасхода_3 = Значение;  
   	
   		Если ОпределитьОргСтруктураРасходыКод(Значение)  =  "000000003" Тогда  // 03 - Зарплата / 04 - расход
        		Элементы.Категория.ТолькоПросмотр = ложь; 
        	Иначе Элементы.Категория.ТолькоПросмотр = Истина; 
    		КонецЕсли;
   	
    КонецЕсли;
   
КонецПроцедуры

ФУНКЦИЯ ОпределитьКатегориюСтатьи(Значение)
	
	Возврат Значение.Родитель; 
	
КонецФункции

ФУНКЦИЯ ОпределитьОргСтруктураРасходыКод(Значение)
	
	Возврат Значение.ОргСтруктураРасходы.Код; 
	
КонецФункции










#КонецОбласти
